testing/case_1p2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "20000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
10981
(
(0.00578088 -1.35703e-05 0)
(0.011889 -2.36207e-05 0)
(0.0153972 -2.41985e-06 0)
(0.0180197 4.61658e-05 0)
(0.0200762 0.000119982 0)
(0.0216689 0.000208059 0)
(0.0228776 0.000299976 0)
(0.0237874 0.00038936 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
