testing/case_1p2/0/R
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
10981
(
(2.56981e-06 -4.53715e-07 8.9958e-35 2.57358e-06 -0 2.57167e-06)
(1.50753e-05 -8.40826e-06 7.60339e-31 1.50507e-05 -0 1.50678e-05)
(1.87126e-05 -9.3841e-06 -0 1.83054e-05 -0 1.85153e-05)
(2.03869e-05 -9.76165e-06 -0 1.93675e-05 -0 1.98762e-05)
(2.13015e-05 -9.64278e-06 -0 1.95737e-05 -0 2.04372e-05)
(2.19413e-05 -9.12429e-06 -0 1.95367e-05 -0 2.07394e-05)
(2.25474e-05 -8.34267e-06 -0 1.95495e-05 -0 2.10485e-05)
(2.32071e-05 -7.4254e-06 -0 1.97057e-05 -0 2.1456e-05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
139
(
(4.05942e-08 -0 0 4.05942e-08 -0 4.05942e-08)
(3.99995e-08 -0 -0 3.99995e-08 -0 3.99995e-08)
(4.0059e-08 -0 -0 4.0059e-08 -0 4.0059e-08)
(3.73151e-08 -0 -0 3.73151e-08 -0 3.73151e-08)
(3.37043e-08 -0 0 3.37043e-08 -0 3.37043e-08)
(3.01754e-08 -0 0 3.01754e-08 0 3.01754e-08)
(2.56017e-08 -0 -0 2.56017e-08 0 2.56017e-08)
(2.02214e-08 -0 0 2.02214e-08 -0 2.02214e-08)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
139
(
(6.66391e-09 0 0 6.66391e-09 -0 6.66391e-09)
(6.69993e-09 0 0 6.69993e-09 -0 6.69993e-09)
(6.73293e-09 0 -0 6.73293e-09 -0 6.73293e-09)
(6.77053e-09 0 0 6.77053e-09 0 6.77053e-09)
(6.82333e-09 0 -0 6.82333e-09 -0 6.82333e-09)
(6.90353e-09 0 -0 6.90353e-09 -0 6.90353e-09)
(7.01827e-09 0 -0 7.01827e-09 0 7.01827e-09)
(7.17653e-09 0 0 7.17653e-09 0 7.17653e-09)
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
