testing/case_1p2/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
4.28614e-06
4.084e-06
3.22838e-06
2.50835e-06
1.91969e-06
1.46398e-06
1.13001e-06
8.92636e-07
...
)
;

boundaryField
{
    bottomWall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
139
(
4.28614e-06
4.25406e-06
4.25729e-06
4.10589e-06
3.90411e-06
3.70627e-06
3.44772e-06
3.12922e-06
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
139
(
1.7131e-06
1.71777e-06
1.72205e-06
1.72591e-06
1.72872e-06
1.73056e-06
1.73095e-06
1.72926e-06
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
