testing/case_1p2/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
3.85753e-06
2.25969e-05
2.77666e-05
2.98153e-05
3.06562e-05
3.11087e-05
3.15727e-05
3.21844e-05
...
)
;

boundaryField
{
    bottomWall
    {
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
139
(
6.08913e-08
5.99993e-08
6.00885e-08
5.59727e-08
5.05565e-08
4.52631e-08
3.84025e-08
3.03321e-08
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
139
(
9.99586e-09
1.00499e-08
1.00994e-08
1.01558e-08
1.0235e-08
1.03553e-08
1.05274e-08
1.07648e-08
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
