testing/case_1p2/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "20000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
21744
(
-6.63288e-08
3.50827e-06
-5.43903e-08
7.744e-06
7.69701e-08
1.08043e-05
3.22401e-07
1.36393e-05
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
        value           nonuniform 0();
    }
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
79
(
3.44195e-06
7.75594e-06
1.09357e-05
1.38847e-05
1.67334e-05
1.94971e-05
2.21942e-05
2.48623e-05
...
)
;
    }
    inlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
79
(
-3.44195e-06
-7.75594e-06
-1.09357e-05
-1.38847e-05
-1.67334e-05
-1.94971e-05
-2.21942e-05
-2.48623e-05
...
)
;
    }
}


// ************************************************************************* //
